Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
/*!
* Copyright (c) 2014, Freescale Semiconductor, Inc.
* All rights reserved.
*
* \file ApplMain.c
* This is a source file for the main application.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/
/* Drv */
//#include "LED.h"
//#include "Keyboard.h"
#include "KW4xXcvrDrv.h"

/* Fwk */
#include "MemManager.h"
#include "TimersManager.h"
#include "RNG_Interface.h"
#include "Messaging.h"
#include "Flash_Adapter.h"
#include "SecLib.h"
#include "Panic.h"

#if gFsciIncluded_c
  #include "FsciInterface.h"
  #include "FsciCommands.h"
#endif

/* KSDK */
#include "board.h"
#include "fsl_device_registers.h"

/* Bluetooth Low Energy */
#include "gatt_interface.h"
#include "gatt_server_interface.h"
#include "gatt_client_interface.h"
#include "gap_interface.h"
#include "l2ca_cb_interface.h"
#include "l2ca_interface.h"

#ifdef cPWR_UsePowerDownMode
  #if (cPWR_UsePowerDownMode)
    #include "PWR_Interface.h"
  #endif
#endif
#include "BLE_common_app.h"
#include "ble_controller_task_config.h"
#include "controller_interface.h"
#include "ble_host_task_config.h"

#include "K66BLEZ.h"

/************************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
************************************************************************************/
#ifndef mAppUseNvm_d
  #define mAppUseNvm_d    TRUE
#endif

/* Application Events */
#define gAppEvtMsgFromHostStack_c       (1 << 0)

#define gAppIdleTaskPriority_c          (8)
#define gAppIdleTaskStackSize_c         (400)

/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/
/* Host to Application Messages Types */
typedef enum {
  gAppGapGenericMsg_c = 0,
  gAppGapConnectionMsg_c,
  gAppGapAdvertisementMsg_c,
  gAppGapScanMsg_c,
  gAppGattServerMsg_c,
  gAppGattClientProcedureMsg_c,
  gAppGattClientNotificationMsg_c,
  gAppGattClientIndicationMsg_c,
  gAppL2caLeDataMsg_c,
  gAppL2caLeControlMsg_c,
}appHostMsgType_tag;

typedef uint8_t appHostMsgType_t;

/* Host to Application Connection Message */
typedef struct connectionMsg_tag {
  deviceId_t              deviceId;
  gapConnectionEvent_t    connEvent;
}connectionMsg_t;

/* Host to Application GATT Server Message */
typedef struct gattServerMsg_tag {
  deviceId_t          deviceId;
  gattServerEvent_t   serverEvent;
}gattServerMsg_t;

/* Host to Application GATT Client Procedure Message */
typedef struct gattClientProcMsg_tag {
  deviceId_t              deviceId;
  gattProcedureType_t     procedureType;
  gattProcedureResult_t   procedureResult;
  bleResult_t             error;
}gattClientProcMsg_t;

/* Host to Application GATT Client Notification/Indication Message */
typedef struct gattClientNotifIndMsg_tag {
  uint8_t *aValue;
  uint16_t    characteristicValueHandle;
  uint16_t    valueLength;
  deviceId_t  deviceId;
}gattClientNotifIndMsg_t;

/* L2ca to Application Data Message */
typedef struct l2caLeCbDataMsg_tag {
  deviceId_t  deviceId;
  uint16_t    lePsm;
  uint16_t    packetLength;
  uint8_t     aPacket[0];
}l2caLeCbDataMsg_t;

/* L2ca to Application Control Message */
typedef struct l2caLeCbControlMsg_tag {
  l2capControlMessageType_t   messageType;
  uint16_t                    padding;
  uint8_t                     aMessage[0];
}l2caLeCbControlMsg_t;

typedef struct appMsgFromHost_tag {
  appHostMsgType_t    msgType;
  union
  {
    gapGenericEvent_t       genericMsg;
    gapAdvertisingEvent_t   advMsg;
    connectionMsg_t         connMsg;
    gapScanningEvent_t      scanMsg;
    gattServerMsg_t         gattServerMsg;
    gattClientProcMsg_t     gattClientProcMsg;
    gattClientNotifIndMsg_t gattClientNotifIndMsg;
    l2caLeCbDataMsg_t       l2caLeCbDataMsg;
    l2caLeCbControlMsg_t    l2caLeCbControlMsg;
  } msgData;
}appMsgFromHost_t;

/************************************************************************************
*************************************************************************************
* Private prototypes
*************************************************************************************
************************************************************************************/
#if (cPWR_UsePowerDownMode)
static osaStatus_t AppIdle_TaskInit(void);
static void App_Idle_Task(task_param_t argument);
#endif

