Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
static void App_Thread(uint32_t param);
static void App_HandleHostMessageInput(appMsgFromHost_t *pMsg);
static void App_GenericCallback(gapGenericEvent_t *pGenericEvent);
static void App_ConnectionCallback(deviceId_t peerDeviceId, gapConnectionEvent_t *pConnectionEvent);
static void App_AdvertisingCallback(gapAdvertisingEvent_t *pAdvertisingEvent);
static void App_ScanningCallback(gapScanningEvent_t *pAdvertisingEvent);
static void App_GattServerCallback(deviceId_t peerDeviceId, gattServerEvent_t *pServerEvent);
static void App_GattClientProcedureCallback
(
 deviceId_t              deviceId,
 gattProcedureType_t     procedureType,
 gattProcedureResult_t   procedureResult,
 bleResult_t             error
);
static void App_GattClientNotificationCallback
(
 deviceId_t      deviceId,
 uint16_t        characteristicValueHandle,
 uint8_t *aValue,
 uint16_t        valueLength
);
static void App_GattClientIndicationCallback
(
 deviceId_t      deviceId,
 uint16_t        characteristicValueHandle,
 uint8_t *aValue,
 uint16_t        valueLength
);

static void App_L2caLeDataCallback
(
 deviceId_t deviceId,
 uint16_t   lePsm,
 uint8_t *pPacket,
 uint16_t packetLength
);

static void App_L2caLeControlCallback
(
 l2capControlMessageType_t  messageType,
 void *pMessage
);

static void BLE_SignalFromISRCallback(void);
/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/
#if cPWR_UsePowerDownMode
OSA_TASK_DEFINE(IDLE, gAppIdleTaskStackSize_c);
task_handler_t gAppIdleTaskId = 0;
#endif  /* cPWR_UsePowerDownMode */

static event_t  mAppEvent;

/* Application input queues */
static anchor_t mHostAppInputQueue;

static uint8_t platformInitialized = 0;

static gapAdvertisingCallback_t         pfAdvCallback = NULL;
static gapScanningCallback_t            pfScanCallback = NULL;
static gapConnectionCallback_t          pfConnCallback = NULL;
static gattServerCallback_t             pfGattServerCallback = NULL;
static gattClientProcedureCallback_t    pfGattClientProcCallback = NULL;
static gattClientNotificationCallback_t pfGattClientNotifCallback = NULL;
static gattClientNotificationCallback_t pfGattClientIndCallback = NULL;
static l2caLeCbDataCallback_t           pfL2caLeCbDataCallback = NULL;
static l2caLeCbControlCallback_t        pfL2caLeCbControlCallback = NULL;


#if gRNG_HWSupport_d == gRNG_NoHWSupport_d
extern uint32_t mRandomNumber;
#endif
extern const uint8_t gUseRtos_c;
extern uint32_t NV_STORAGE_END_ADDRESS[];
uint32_t gNvmStartAddress_c;


#if gUseHciTransportUpward_d
  #define BleApp_GenericCallback(param)
#else
extern void BleApp_GenericCallback(gapGenericEvent_t *pGenericEvent);
#endif

extern void (*pfBLE_SignalFromISR)(void);
extern uint8_t gBDAddress_c[6];
extern void BleApp_Start(void);

bleResult_t Ble_Initialize(gapGenericCallback_t gapGenericCallback)
{
  bleResult_t res;
  DEBUG_PRINT("Ble_Initialize\r\n");



#if (gUseHciTransportDownward_d == 1)

  /* Configure HCI Transport */
  hcitConfigStruct_t hcitConfigStruct =
  {
    .interfaceType = gHcitInterfaceType_d,
    .interfaceChannel = gHcitInterfaceNumber_d,
    .interfaceBaudrate = gHcitInterfaceSpeed_d,
    .transportInterface =  Ble_HciRecv
  };

  /* HCI Transport Init */
  if (gHciSuccess_c != Hcit_Init(&hcitConfigStruct))
  {
    return gHciTransportError_c;
  }

  /* BLE Host Tasks Init */
  if (osaStatus_Success != Ble_HostTaskInit())
  {
    return gBleOsError_c;
  }

  DEBUG_PRINT("Ble_HostInitialize\r\n");
  res = Ble_HostInitialize(gapGenericCallback, (hciHostToControllerInterface_t)Hcit_SendPacket);

  /* BLE Host Stack Init */

  return res;

#elif (gUseHciTransportUpward_d == 1)

  if (osaStatus_Success != Controller_TaskInit())
  {
    return gBleOsError_c;
  }

  /* BLE Controller Init */
  DEBUG_PRINT("Controller_Init\r\n");
  if (osaStatus_Success != Controller_Init((gHostRecvCallback_t)Hcit_SendPacket))
  {
    return gBleOsError_c;
  }

  /* Configure HCI Transport */
  hcitConfigStruct_t hcitConfigStruct =
  {
    .interfaceType = gHcitInterfaceType_d,
    .interfaceChannel = gHcitInterfaceNumber_d,
    .interfaceBaudrate = gHcitInterfaceSpeed_d,
    .transportInterface =  Controller_RecvPacket
  };

  return Hcit_Init(&hcitConfigStruct);

#else
  /* BLE Controller Task Init */
  if (osaStatus_Success != Controller_TaskInit())
  {
    return gBleOsError_c;
  }

  /* BLE Controller Init */
  DEBUG_PRINT("Controller_Init\r\n");
  if (osaStatus_Success != Controller_Init(Ble_HciRecv))
  {
    return gBleOsError_c;
  }

  /* BLE Host Tasks Init */
  if (osaStatus_Success != Ble_HostTaskInit())
  {
    return gBleOsError_c;
  }

  /* BLE Host Stack Init */
  DEBUG_PRINT("Ble_HostInitialize\r\n");
  res = Ble_HostInitialize(gapGenericCallback, (hciHostToControllerInterface_t)Controller_RecvPacket);
  return res;

#endif
}


/*! *********************************************************************************
* \brief  This function represents the Application task.
*         This task reuses the stack alocated for the MainThread.
*         This function is called to process all events for the task. Events
*         include timers, messages and any other user defined events.
* \param[in]  argument
*
********************************************************************************** */
void App_Thread(uint32_t param)
{
  event_flags_t event;

  DEBUG_PRINT("App_Thread\r\n");
  while (1)
  {
    OSA_EventWait(&mAppEvent, 0x00FFFFFF, FALSE, OSA_WAIT_FOREVER, &event);

    /* Dequeue the host to app message */
    if (event & gAppEvtMsgFromHostStack_c)
    {
      /* Pointer for storing the messages from host. */
      appMsgFromHost_t *pMsgIn = NULL;

      /* Check for existing messages in queue */
      while (MSG_Pending(&mHostAppInputQueue))
      {
        pMsgIn = MSG_DeQueue(&mHostAppInputQueue);

