Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
        if (pMsgIn)
        {
          /* Process it */
          App_HandleHostMessageInput(pMsgIn);

          /* Messages must always be freed. */
          MSG_Free(pMsgIn);
          pMsgIn = NULL;
        }
      }
    }
    else
    {
      DEBUG_PRINT(".. App_Thread. Unrecognized message!\r\n");
    }

    /* For BareMetal break the while(1) after 1 run */
    if (gUseRtos_c == 0)
    {
      break;
    }
  }
}

#if (cPWR_UsePowerDownMode)
/*------------------------------------------------------------------------------



 \return osaStatus_t
 ------------------------------------------------------------------------------*/
static osaStatus_t AppIdle_TaskInit(void)
{
  osa_status_t status;

  if (gAppIdleTaskId)
  {
    return osaStatus_Error;
  }

  /* Task creation */
  status = OSA_TaskCreate(App_Idle_Task, "IDLE_Task", gAppIdleTaskStackSize_c, IDLE_stack, gAppIdleTaskPriority_c, (task_param_t)NULL, FALSE, &gAppIdleTaskId);

  if (kStatus_OSA_Success != status)
  {
    panic(0, 0, 0, 0);
    return osaStatus_Error;
  }

  return osaStatus_Success;
}

/*------------------------------------------------------------------------------



 \param argument
 ------------------------------------------------------------------------------*/
static void App_Idle_Task(task_param_t argument)
{
  PWRLib_WakeupReason_t wakeupReason;
  volatile uint32_t regPCRB2;

  while (1)
  {
    if (PWR_CheckIfDeviceCanGoToSleep())
    {
      /* Enter Low Power */
      wakeupReason = PWR_EnterLowPower();

  #if gFSCI_IncludeLpmCommands_c
      /* Send Wake Up indication to FSCI */
      FSCI_SendWakeUpIndication();
  #endif

//      Вызывается если переход в сон был вызван кнопкой
//      KBD_SwitchPressedOnWakeUp();
//      PWR_DisallowDeviceToSleep();
    }

    /* For BareMetal break the while(1) after 1 run */
    if (gUseRtos_c == 0)
    {
      break;
    }
  }
}
#endif

/*------------------------------------------------------------------------------



 \param advertisingCallback
 \param connectionCallback
 ------------------------------------------------------------------------------*/
void App_StartAdvertising(gapAdvertisingCallback_t    advertisingCallback, gapConnectionCallback_t     connectionCallback)
{
  pfAdvCallback = advertisingCallback;
  pfConnCallback = connectionCallback;

  Gap_StartAdvertising(App_AdvertisingCallback, App_ConnectionCallback);
}

/*------------------------------------------------------------------------------



 \param pScanningParameters
 \param scanningCallback
 ------------------------------------------------------------------------------*/
void App_StartScanning(gapScanningParameters_t *pScanningParameters, gapScanningCallback_t       scanningCallback)
{
  pfScanCallback = scanningCallback;

  Gap_StartScanning(pScanningParameters, App_ScanningCallback);
}

/*------------------------------------------------------------------------------



 \param serverCallback
 ------------------------------------------------------------------------------*/
void App_RegisterGattServerCallback(gattServerCallback_t  serverCallback)
{
  pfGattServerCallback = serverCallback;

  GattServer_RegisterCallback(App_GattServerCallback);
}

/*------------------------------------------------------------------------------



 \param callback
 ------------------------------------------------------------------------------*/
void App_RegisterGattClientProcedureCallback(gattClientProcedureCallback_t  callback)
{
  pfGattClientProcCallback = callback;

  GattClient_RegisterProcedureCallback(App_GattClientProcedureCallback);
}

/*------------------------------------------------------------------------------



 \param callback
 ------------------------------------------------------------------------------*/
void App_RegisterGattClientNotificationCallback(gattClientNotificationCallback_t  callback)
{
  pfGattClientNotifCallback = callback;

  GattClient_RegisterNotificationCallback(App_GattClientNotificationCallback);
}

/*------------------------------------------------------------------------------



 \param callback
 ------------------------------------------------------------------------------*/
void App_RegisterGattClientIndicationCallback(gattClientIndicationCallback_t  callback)
{
  pfGattClientIndCallback = callback;

  GattClient_RegisterIndicationCallback(App_GattClientIndicationCallback);
}

/*------------------------------------------------------------------------------



 \param lePsm
 \param pCallback
 \param pCtrlCallback
 \param lePsmMtu
 ------------------------------------------------------------------------------*/
void App_RegisterLePsm(uint16_t lePsm, l2caLeCbDataCallback_t pCallback, l2caLeCbControlCallback_t pCtrlCallback, uint16_t lePsmMtu)
{
  pfL2caLeCbDataCallback = pCallback;
  pfL2caLeCbControlCallback = pCtrlCallback;
  L2ca_RegisterLePsm(lePsm, App_L2caLeDataCallback, App_L2caLeControlCallback, lePsmMtu);
}

/*------------------------------------------------------------------------------



 \param pCallback
 ------------------------------------------------------------------------------*/
void App_RegisterL2caControlCallback(l2caControlCallback_t pCallback)
{
  pfL2caLeCbControlCallback = pCallback;
  L2ca_RegisterControlCallback(App_L2caLeControlCallback);
}

/*------------------------------------------------------------------------------



 \param nvmStartAddress
 \param nvmSize
 ------------------------------------------------------------------------------*/
void App_NvmErase(uint32_t nvmStartAddress, uint32_t nvmSize)
{
#if mAppUseNvm_d
  (void)nvmSize;
  NV_FlashEraseSector(&gFlashConfig, nvmStartAddress, gcReservedFlashSizeForBondedDevicesData_c, gFlashLaunchCommand);
#endif
}

/*------------------------------------------------------------------------------



 \param nvmDestinationAddress
 \param pvRamSource
 \param cDataSize
 ------------------------------------------------------------------------------*/
void App_NvmWrite(uint32_t nvmDestinationAddress, void *pvRamSource, uint32_t cDataSize)
{
#if mAppUseNvm_d
  NV_FlashProgramUnaligned(&gFlashConfig, nvmDestinationAddress, cDataSize, pvRamSource, gFlashLaunchCommand);
#endif
}

/*------------------------------------------------------------------------------



 \param nvmSourceAddress
 \param pvRamDestination
 \param cDataSize
 ------------------------------------------------------------------------------*/
void App_NvmRead(uint32_t nvmSourceAddress, void *pvRamDestination, uint32_t cDataSize)
{
#if mAppUseNvm_d
  NV_FlashRead(nvmSourceAddress, pvRamDestination, cDataSize);
#endif
}


/*****************************************************************************
* Handles all messages received from the host task.
* Interface assumptions: None
* Return value: None
*****************************************************************************/
static void App_HandleHostMessageInput(appMsgFromHost_t *pMsg)
{

  switch (pMsg->msgType)
  {
  case gAppGapGenericMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGapGenericMsg_c\r\n");

      BleApp_GenericCallback(&pMsg->msgData.genericMsg);
      break;
    }
  case gAppGapAdvertisementMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGapAdvertisementMsg_c\r\n");

