Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
      if (pfAdvCallback) pfAdvCallback(&pMsg->msgData.advMsg);
      break;
    }
  case gAppGapScanMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGapScanMsg_c\r\n");

      if (pfScanCallback) pfScanCallback(&pMsg->msgData.scanMsg);
      break;
    }
  case gAppGapConnectionMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGapConnectionMsg_c\r\n");

      if (pfConnCallback) pfConnCallback(pMsg->msgData.connMsg.deviceId, &pMsg->msgData.connMsg.connEvent);
      break;
    }
  case gAppGattServerMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGattServerMsg_c\r\n");

      if (pfGattServerCallback) pfGattServerCallback(pMsg->msgData.gattServerMsg.deviceId, &pMsg->msgData.gattServerMsg.serverEvent);
      break;
    }
  case gAppGattClientProcedureMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGattClientProcedureMsg_c\r\n");

      if (pfGattClientProcCallback) pfGattClientProcCallback(pMsg->msgData.gattClientProcMsg.deviceId,
                                                             pMsg->msgData.gattClientProcMsg.procedureType,
                                                             pMsg->msgData.gattClientProcMsg.procedureResult,
                                                             pMsg->msgData.gattClientProcMsg.error);
      break;
    }
  case gAppGattClientNotificationMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGattClientNotificationMsg_c\r\n");

      if (pfGattClientNotifCallback) pfGattClientNotifCallback(
                                                               pMsg->msgData.gattClientNotifIndMsg.deviceId,
                                                               pMsg->msgData.gattClientNotifIndMsg.characteristicValueHandle,
                                                               pMsg->msgData.gattClientNotifIndMsg.aValue,
                                                               pMsg->msgData.gattClientNotifIndMsg.valueLength);
      break;
    }
  case gAppGattClientIndicationMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppGattClientIndicationMsg_c\r\n");

      if (pfGattClientIndCallback) pfGattClientIndCallback(
                                                           pMsg->msgData.gattClientNotifIndMsg.deviceId,
                                                           pMsg->msgData.gattClientNotifIndMsg.characteristicValueHandle,
                                                           pMsg->msgData.gattClientNotifIndMsg.aValue,
                                                           pMsg->msgData.gattClientNotifIndMsg.valueLength);
      break;
    }
  case gAppL2caLeDataMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppL2caLeDataMsg_c\r\n");

      if (pfL2caLeCbDataCallback) pfL2caLeCbDataCallback(
                                                         pMsg->msgData.l2caLeCbDataMsg.deviceId,
                                                         pMsg->msgData.l2caLeCbDataMsg.lePsm,
                                                         pMsg->msgData.l2caLeCbDataMsg.aPacket,
                                                         pMsg->msgData.l2caLeCbDataMsg.packetLength);
      break;
    }
  case gAppL2caLeControlMsg_c:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - gAppL2caLeControlMsg_c\r\n");

      if (pfL2caLeCbControlCallback) pfL2caLeCbControlCallback(
                                                               pMsg->msgData.l2caLeCbControlMsg.messageType,
                                                               pMsg->msgData.l2caLeCbControlMsg.aMessage);
      break;
    }
  default:
    {
      DEBUG_PRINT(".. App_HandleHostMessageInput - default\r\n");
      break;
    }
  }
}

/*------------------------------------------------------------------------------



 \param pGenericEvent
 ------------------------------------------------------------------------------*/
static void App_GenericCallback(gapGenericEvent_t *pGenericEvent)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_GenericCallback\r\n");

  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gapGenericEvent_t));

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGapGenericMsg_c;
  FLib_MemCpy(&pMsgIn->msgData.genericMsg, pGenericEvent, sizeof(gapGenericEvent_t));

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param peerDeviceId
 \param pConnectionEvent
 ------------------------------------------------------------------------------*/
static void App_ConnectionCallback(deviceId_t peerDeviceId, gapConnectionEvent_t *pConnectionEvent)
{
  appMsgFromHost_t *pMsgIn = NULL;
  uint8_t msgLen = GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gapConnectionEvent_t);

  DEBUG_PRINT("-> App_ConnectionCallback\r\n");


  if (pConnectionEvent->eventType == gConnEvtKeysReceived_c)
  {
    gapSmpKeys_t    *pKeys = pConnectionEvent->eventData.keysReceivedEvent.pKeys;

    /* Take into account alignment */
    msgLen = GetRelAddr(appMsgFromHost_t, msgData) + GetRelAddr(connectionMsg_t, connEvent) +
             GetRelAddr(gapConnectionEvent_t, eventData) + sizeof(gapKeysReceivedEvent_t) + sizeof(gapSmpKeys_t);

    if (pKeys->aLtk != NULL)
    {
      msgLen += 2 * sizeof(uint8_t) + pKeys->cLtkSize + pKeys->cRandSize;
    }

    msgLen += (pKeys->aIrk != NULL) ? (gcSmpIrkSize_c + gcBleDeviceAddressSize_c) : 0;
    msgLen += (pKeys->aCsrk != NULL) ? gcSmpCsrkSize_c : 0;
  }

  pMsgIn = MSG_Alloc(msgLen);

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGapConnectionMsg_c;
  pMsgIn->msgData.connMsg.deviceId = peerDeviceId;

  if (pConnectionEvent->eventType == gConnEvtKeysReceived_c)
  {
    gapSmpKeys_t    *pKeys = pConnectionEvent->eventData.keysReceivedEvent.pKeys;
    uint8_t         *pCursor = (uint8_t *)&pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys;

    pMsgIn->msgData.connMsg.connEvent.eventType = gConnEvtKeysReceived_c;
    pCursor += sizeof(void *);
    pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys = (gapSmpKeys_t *)pCursor;

    /* Copy SMP Keys structure */
    FLib_MemCpy(pCursor, pConnectionEvent->eventData.keysReceivedEvent.pKeys, sizeof(gapSmpKeys_t));
    pCursor += sizeof(gapSmpKeys_t);

    if (pKeys->aLtk != NULL)
    {
      /* Copy LTK */
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->cLtkSize = pKeys->cLtkSize;
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->aLtk = pCursor;
      FLib_MemCpy(pCursor, pKeys->aLtk, pKeys->cLtkSize);
      pCursor += pKeys->cLtkSize;

