Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
      /* Copy RAND */
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->cRandSize = pKeys->cRandSize;
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->aRand = pCursor;
      FLib_MemCpy(pCursor, pKeys->aRand, pKeys->cRandSize);
      pCursor += pKeys->cRandSize;
    }
    else if (pKeys->aIrk != NULL)
    {
      /* Copy IRK */
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->aIrk = pCursor;
      FLib_MemCpy(pCursor, pKeys->aIrk, gcSmpIrkSize_c);
      pCursor += gcSmpIrkSize_c;

      /* Copy Address*/
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->addressType = pKeys->addressType;
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->aAddress = pCursor;
      FLib_MemCpy(pCursor, pKeys->aAddress, gcBleDeviceAddressSize_c);
      pCursor += gcBleDeviceAddressSize_c;
    }

    if (pKeys->aCsrk != NULL)
    {
      /* Copy CSRK */
      pMsgIn->msgData.connMsg.connEvent.eventData.keysReceivedEvent.pKeys->aCsrk = pCursor;
      FLib_MemCpy(pCursor, pKeys->aCsrk, gcSmpCsrkSize_c);
    }
  }
  else
  {
    FLib_MemCpy(&pMsgIn->msgData.connMsg.connEvent, pConnectionEvent, sizeof(gapConnectionEvent_t));
  }

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param pAdvertisingEvent
 ------------------------------------------------------------------------------*/
static void App_AdvertisingCallback(gapAdvertisingEvent_t *pAdvertisingEvent)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_AdvertisingCallback\r\n");


  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gapAdvertisingEvent_t));

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGapAdvertisementMsg_c;
  pMsgIn->msgData.advMsg.eventType = pAdvertisingEvent->eventType;
  pMsgIn->msgData.advMsg.eventData = pAdvertisingEvent->eventData;

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param pScanningEvent
 ------------------------------------------------------------------------------*/
static void App_ScanningCallback(gapScanningEvent_t *pScanningEvent)
{
  appMsgFromHost_t *pMsgIn = NULL;

  uint8_t msgLen = GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gapScanningEvent_t);

  DEBUG_PRINT("-> App_ScanningCallback\r\n");


  if (pScanningEvent->eventType == gDeviceScanned_c)
  {
    msgLen += pScanningEvent->eventData.scannedDevice.dataLength;
  }

  pMsgIn = MSG_Alloc(msgLen);

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGapScanMsg_c;
  pMsgIn->msgData.scanMsg.eventType = pScanningEvent->eventType;

  if (pScanningEvent->eventType == gScanCommandFailed_c)
  {
    pMsgIn->msgData.scanMsg.eventData.failReason = pScanningEvent->eventData.failReason;
  }

  if (pScanningEvent->eventType == gDeviceScanned_c)
  {
    FLib_MemCpy(&pMsgIn->msgData.scanMsg.eventData.scannedDevice,
                &pScanningEvent->eventData.scannedDevice,
                sizeof(gapScanningEvent_t));

    /* Copy data after the gapScanningEvent_t structure and update the data pointer*/
    pMsgIn->msgData.scanMsg.eventData.scannedDevice.data = (uint8_t *)&pMsgIn->msgData + sizeof(gapScanningEvent_t);
    FLib_MemCpy(pMsgIn->msgData.scanMsg.eventData.scannedDevice.data,
                pScanningEvent->eventData.scannedDevice.data,
                pScanningEvent->eventData.scannedDevice.dataLength);
  }

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param deviceId
 \param pServerEvent
 ------------------------------------------------------------------------------*/
static void App_GattServerCallback(deviceId_t deviceId, gattServerEvent_t *pServerEvent)
{
  appMsgFromHost_t *pMsgIn = NULL;
  uint8_t msgLen = GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gattServerMsg_t);

  DEBUG_PRINT("-> App_GattServerCallback\r\n");


  if (pServerEvent->eventType == gEvtAttributeWritten_c || pServerEvent->eventType == gEvtAttributeWrittenWithoutResponse_c)
  {
    msgLen += pServerEvent->eventData.attributeWrittenEvent.cValueLength;
  }

  pMsgIn = MSG_Alloc(msgLen);

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGattServerMsg_c;
  pMsgIn->msgData.gattServerMsg.deviceId = deviceId;
  FLib_MemCpy(&pMsgIn->msgData.gattServerMsg.serverEvent, pServerEvent, sizeof(gattServerEvent_t));

  if ((pMsgIn->msgData.gattServerMsg.serverEvent.eventType == gEvtAttributeWritten_c) || (pMsgIn->msgData.gattServerMsg.serverEvent.eventType == gEvtAttributeWrittenWithoutResponse_c))
  {
    /* Copy value after the gattServerEvent_t structure and update the aValue pointer*/
    pMsgIn->msgData.gattServerMsg.serverEvent.eventData.attributeWrittenEvent.aValue = (uint8_t *)&pMsgIn->msgData.gattServerMsg.serverEvent.eventData.attributeWrittenEvent.aValue + sizeof(uint8_t *);
    FLib_MemCpy(pMsgIn->msgData.gattServerMsg.serverEvent.eventData.attributeWrittenEvent.aValue, pServerEvent->eventData.attributeWrittenEvent.aValue, pServerEvent->eventData.attributeWrittenEvent.cValueLength);

  }

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param deviceId
 \param procedureType
 \param procedureResult
 \param error
 ------------------------------------------------------------------------------*/
static void App_GattClientProcedureCallback(deviceId_t deviceId, gattProcedureType_t procedureType, gattProcedureResult_t   procedureResult, bleResult_t error)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_GattClientProcedureCallback\r\n");


