Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gattClientProcMsg_t));

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGattClientProcedureMsg_c;
  pMsgIn->msgData.gattClientProcMsg.deviceId = deviceId;
  pMsgIn->msgData.gattClientProcMsg.procedureType = procedureType;
  pMsgIn->msgData.gattClientProcMsg.error = error;
  pMsgIn->msgData.gattClientProcMsg.procedureResult = procedureResult;

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param deviceId
 \param characteristicValueHandle
 \param aValue
 \param valueLength
 ------------------------------------------------------------------------------*/
static void App_GattClientNotificationCallback(deviceId_t deviceId, uint16_t characteristicValueHandle, uint8_t *aValue, uint16_t valueLength)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_GattClientNotificationCallback\r\n");

  /* Allocate a buffer with enough space to store also the notified value*/
  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gattClientNotifIndMsg_t)
                     + valueLength);

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGattClientNotificationMsg_c;
  pMsgIn->msgData.gattClientNotifIndMsg.deviceId = deviceId;
  pMsgIn->msgData.gattClientNotifIndMsg.characteristicValueHandle = characteristicValueHandle;
  pMsgIn->msgData.gattClientNotifIndMsg.valueLength = valueLength;

  /* Copy value after the gattClientNotifIndMsg_t structure and update the aValue pointer*/
  pMsgIn->msgData.gattClientNotifIndMsg.aValue = (uint8_t *)&pMsgIn->msgData + sizeof(gattClientNotifIndMsg_t);
  FLib_MemCpy(pMsgIn->msgData.gattClientNotifIndMsg.aValue, aValue, valueLength);

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param deviceId
 \param characteristicValueHandle
 \param aValue
 \param valueLength
 ------------------------------------------------------------------------------*/
static void App_GattClientIndicationCallback(deviceId_t deviceId, uint16_t characteristicValueHandle, uint8_t *aValue, uint16_t valueLength)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_GattClientIndicationCallback\r\n");


  /* Allocate a buffer with enough space to store also the notified value*/
  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(gattClientNotifIndMsg_t)
                     + valueLength);

  if (!pMsgIn) return;

  pMsgIn->msgType = gAppGattClientIndicationMsg_c;
  pMsgIn->msgData.gattClientNotifIndMsg.deviceId = deviceId;
  pMsgIn->msgData.gattClientNotifIndMsg.characteristicValueHandle = characteristicValueHandle;
  pMsgIn->msgData.gattClientNotifIndMsg.valueLength = valueLength;

  /* Copy value after the gattClientIndIndMsg_t structure and update the aValue pointer*/
  pMsgIn->msgData.gattClientNotifIndMsg.aValue = (uint8_t *)&pMsgIn->msgData + sizeof(gattClientNotifIndMsg_t);
  FLib_MemCpy(pMsgIn->msgData.gattClientNotifIndMsg.aValue, aValue, valueLength);

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param deviceId
 \param lePsm
 \param pPacket
 \param packetLength
 ------------------------------------------------------------------------------*/
static void App_L2caLeDataCallback(deviceId_t deviceId, uint16_t lePsm, uint8_t *pPacket, uint16_t packetLength)
{
  appMsgFromHost_t *pMsgIn = NULL;

  DEBUG_PRINT("-> App_L2caLeDataCallback\r\n");

  /* Allocate a buffer with enough space to store the packet */
  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(l2caLeCbDataMsg_t) + packetLength);

  if (!pMsgIn)
  {
    return;
  }

  pMsgIn->msgType = gAppL2caLeDataMsg_c;
  pMsgIn->msgData.l2caLeCbDataMsg.deviceId = deviceId;
  pMsgIn->msgData.l2caLeCbDataMsg.lePsm = lePsm;
  pMsgIn->msgData.l2caLeCbDataMsg.packetLength = packetLength;

  FLib_MemCpy(pMsgIn->msgData.l2caLeCbDataMsg.aPacket, pPacket, packetLength);

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*------------------------------------------------------------------------------



 \param messageType
 \param pMessage
 ------------------------------------------------------------------------------*/
static void App_L2caLeControlCallback(l2capControlMessageType_t messageType, void *pMessage)
{
  appMsgFromHost_t *pMsgIn = NULL;
  uint8_t messageLength = 0;

  DEBUG_PRINT("-> App_L2caLeControlCallback\r\n");

  switch (messageType)
  {
  case gL2ca_LePsmConnectRequest_c:
    {
      messageLength = sizeof(l2caLeCbConnectionRequest_t);
      break;
    }
  case gL2ca_LePsmConnectionComplete_c:
    {
      messageLength = sizeof(l2caLeCbConnectionComplete_t);
      break;
    }
  case gL2ca_LePsmDisconnectNotification_c:
    {
      messageLength = sizeof(l2caLeCbDisconnection_t);
      break;
    }
  case gL2ca_ConnectionParameterUpdateRequest_c:
    {
      messageLength = sizeof(l2caLeCbConnectionParameterUpdateRequest_t);
      break;
    }
  case gL2ca_ConnectionParameterUpdateComplete_c:
    {
      messageLength = sizeof(l2caLeCbConnectionParameterUpdateComplete_t);
      break;
    }
  case gL2ca_NoPeerCredits_c:
    {
      messageLength = sizeof(l2caLeCbNoPeerCredits_t);
      break;
    }
  case gL2ca_LocalCreditsNotification_c:
    {
      messageLength = sizeof(l2caLeCbLocalCreditsNotification_t);
      break;
    }
  default:
    return;
  }


  /* Allocate a buffer with enough space to store the biggest packet */
  pMsgIn = MSG_Alloc(GetRelAddr(appMsgFromHost_t, msgData) + sizeof(l2caLeCbConnectionParameterUpdateRequest_t));

