Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/BLE_App/BLE_common_app.c
  if (!pMsgIn)
  {
    return;
  }

  pMsgIn->msgType = gAppL2caLeControlMsg_c;
  pMsgIn->msgData.l2caLeCbControlMsg.messageType = messageType;

  FLib_MemCpy(pMsgIn->msgData.l2caLeCbControlMsg.aMessage, pMessage, messageLength);

  /* Put message in the Host Stack to App queue */
  MSG_Queue(&mHostAppInputQueue, pMsgIn);

  /* Signal application */
  OSA_EventSet(&mAppEvent, gAppEvtMsgFromHostStack_c);
}




/*------------------------------------------------------------------------------

 Called by BLE when a connect is received

------------------------------------------------------------------------------*/
static void BLE_SignalFromISRCallback(void)
{
#if (cPWR_UsePowerDownMode)
  PWR_DisallowDeviceToSleep();
#endif
}


/*! *********************************************************************************
* \brief  This is the first task created by the OS. This task will initialize
*         the system
*
* \param[in]  param
*
********************************************************************************** */
void main_task(uint32_t param)
{
  if (!platformInitialized)
  {
    osa_status_t status;
    uint8_t pseudoRNGSeed[20] = { 0 };

    platformInitialized = 1;

    hardware_init();
    SEGGER_RTT_Init();
    DEBUG_PRINT("\r\nMain App stared. Compiled:"__TIMESTAMP__"\r\n");

    /* Framework init */
    MEM_Init();
    TMR_Init();    // Инициализация таймера TPM0. Таймер после предделителя тактируется частотой 250000 Гц. Прерывания таймера устанавливаются по срабатыванию компаратора в канале 0
    SecLib_Init();

    BSP_DMA_init();
    BSP_Init_PIT();    // PIT используем для измерения интервалов времени
    BSP_Init_SPI1();


    RNG_Init();
    RNG_GetRandomNo((uint32_t *)(&(pseudoRNGSeed[0])));
    RNG_GetRandomNo((uint32_t *)(&(pseudoRNGSeed[4])));
    RNG_GetRandomNo((uint32_t *)(&(pseudoRNGSeed[8])));
    RNG_GetRandomNo((uint32_t *)(&(pseudoRNGSeed[12])));
    RNG_GetRandomNo((uint32_t *)(&(pseudoRNGSeed[16])));
    RNG_SetPseudoRandomNoSeed(pseudoRNGSeed);


#if mAppUseNvm_d == TRUE
    /* Initialize NV module */
    NV_Init();

    /* NV_STORAGE_END_ADDRESS from linker file is used as NV Start Address */
    gNvmStartAddress_c = (uint32_t)((uint8_t *)NV_STORAGE_END_ADDRESS);
    DEBUG_PRINT("Used NVM.\r\n");
#else
    DEBUG_PRINT("Do not used NVM.\r\n");
#endif

    pfBLE_SignalFromISR = BLE_SignalFromISRCallback;

#if cPWR_UsePowerDownMode == TRUE
    AppIdle_TaskInit();
    PWR_Init();
    PWR_DisallowDeviceToSleep();
    DEBUG_PRINT("Used Power Down Mode.\r\n");
#else
    DEBUG_PRINT("Do not used Power Down Mode.\r\n");
#endif

    // Инициализируем публичный идентификатор BLE
    gBDAddress_c[0] = (SIM->UIDMH  >> 8) & 0xFF;
    gBDAddress_c[1] = (SIM->UIDMH  >> 0) & 0xFF;
    gBDAddress_c[2] = (SIM->UIDML  >> 24) & 0xFF;
    gBDAddress_c[3] = (SIM->UIDML  >> 16) & 0xFF;
    gBDAddress_c[4] = (SIM->UIDML  >> 8) & 0xFF;
    gBDAddress_c[5] = (SIM->UIDML  >> 0) & 0xFF;
    DEBUG_PRINT_ARG("Address = %02X%02X%02X%02X%02X%02X\r\n", gBDAddress_c[0], gBDAddress_c[1], gBDAddress_c[2], gBDAddress_c[3], gBDAddress_c[4], gBDAddress_c[5]);


    /* BLE Radio Init */
    XcvrInit(BLE);

    /* Create application event */
    status = OSA_EventCreate(&mAppEvent, kEventAutoClear);
    if (kStatus_OSA_Success != status)
    {
      panic(0, 0, 0, 0);
      return;
    }

    /* Prepare application input queue.*/
    MSG_InitQueue(&mHostAppInputQueue);

    /* BLE Host Stack Init */
    if (Ble_Initialize(App_GenericCallback) != gBleSuccess_c)
    {
      panic(0, 0, 0, 0);
      return;
    }
  }

  Init_host_channel_task();
  BleApp_Start();


  //------------------------------------------------------------------------------

  /* Call application task */
  App_Thread(param);
}

